[["Police arrest man, 23, in suspected arson-hate crime at Coachella mosque", "https://www.pbs.org/newshour/nation/police-arrest-man-23-in-suspected-arson-hate-crime-at-coachella-mosque", "Police have arrested a 23-year-old man for setting a California mosque on  fire Friday as congregants were preparing for an afternoon prayer...", "Dec 13, 2015", "By —\n\nMichael D. Regan\n                \n                \n                    Michael D. Regan\n\nLeave your feedback\n\nShare\n\nCopy URL\n            https://www.pbs.org/newshour/nation/police-arrest-man-23-in-suspected-arson-hate-crime-at-coachella-mosque\n\nEmail\n\nFacebook\n\nTwitter\n\nLinkedIn\n\nPinterest\n\nTumblr\n\nShare on Facebook\n\nShare on Twitter\n\nPolice arrest man, 23, in suspected arson-hate crime at Coachella mosque\n\nNation\n\nPolice have arrested a 23-year-old man for setting a California mosque on fire Friday as congregants were preparing for an afternoon prayer service.\n\nCarl James Dial Jr. was arrested Friday night and charged with a hate crime for starting the blaze. He is also facing  arson and burglary charges and is being held in lieu of $150,00 bail, the Riverside County Sheriff’s Department said.\n\nCarl James Dial Jr., 23, is shown in this booking photo provided by the Riverside County Sheriff’s Department in Indio, California December 12, 2015. Photo courtesy of Riverside County Sheriff’s Dept/Handout via Reuters.\n\nThe fire took place at the Islamic Society of Coachella Valley, and is one among several incidents across the United States that have taken place against Muslims since the San Bernardino shootings last week.\n\nThe Coachella mosque is located about 75 miles from San Bernardino where 14 people were killed by a husband and wife last week.\n\nWhile investigators have yet to identify the cause of the fire, the mosque’s acting imam Reymundo Nour said people there described hearing a “loud boom” before flames were spotted in the lobby of the religious building.\n\nNour indicated he believed a firebomb was the cause also framing it as a terrorist attack, according to the Associated Press. No one was injured, the police said.\n\n“It’s reprehensible and the people who perpetrated that act should be treated the way we would any other terrorist,” John Benoit, the Riverside County Supervisor, told the Los Angeles Times.\n\nIn an interview with NBC News Dial’s father said he thought his son was attending a college class when he witnessed him carrying backpack on Friday.\n\n“He was caught up in social media,” Dials father said. “Social media has produced people like my son, without person-to-person contact. I believe he was lacking in social skills.”\n\nIn 2014, the same mosque was hit by bullets though no one was charged for the incident.\n\nLeft:\n                A view of damage at the burned Islamic Society of Coachella Valley on Saturday. Photo by Sam Mircovich/Reuters.\n\nGo Deeper\n\narson\n\nfederal hate crime law\n\nfire\n\nmosque\n\npbs\n\npbs newshour\n\npbs newshour weekend\n\nBy —\n\nMichael D. Regan\n                \n                \n                    Michael D. Regan\n\nMichael D. Regan is a senior digital editor for PBS NewsHour.\n\n@mdregan\n\nSupport Provided By:\n    Learn more\n\nEducate your inbox\n\nSubscribe to Here’s the Deal, our politics\n                 newsletter for analysis you won’t find anywhere else.\n\nEmail Address\n\nSubscribe\n\nForm error message goes here.\n\nThank you. Please check your inbox to confirm.\n\nFull Episode\n\nSunday, Sep 3\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"], ["Carl Dial, man who firebombed valley mosque, sentenced", "https://www.desertsun.com/story/news/crime_courts/2016/02/29/carl-dial-man-who-firebombed-valley-mosque-sentenced/81134184/", "A 23-year-old Palm Desert man who threw a Molotov cocktail into a Coachella  Valley mosque, igniting a fire, was sentenced today to six years...", "Feb 29, 2016", "CRIME & COURTS\n\nCarl Dial, man who firebombed valley mosque, sentenced\n\nCity News Service\n\nA 23-year-old Palm Desert man who threw a Molotov cocktail into a Coachella Valley mosque, igniting a fire, was sentenced today to six years in state prison.\n\nCarl James Dial pleaded guilty last month to arson and sentence- enhancing allegations of perpetrating a hate crime and using a destructive device to commit a felony. In exchange for his admissions, prosecutors dropped charges of felony burglary and misdemeanor criminal damage against Dial.\n\nRiverside County Superior Court Judge James Hawkins certified the terms of the plea deal and imposed the sentence stipulated by the prosecution and defense.\n\nCarl Dial to be sentenced for mosque fire\n\nDial was arrested Dec. 11 after firebombing the Islamic Society of the Coachella Valley in Palm Desert.\n\nThe attack happened nine days after husband-wife terrorist team Syed Rizwan Farook, 28, and Tashfeen Mali, 27, massacred 14 people and wounded 22 others at the Inland Regional Center in San Bernardino. Federal investigators characterized the rampage as an act of Islamist terror.\n\nDial lit and tossed his accelerant-filled bottle into the reception area of the 1,800-square-foot Islamic Society mosque, located at 84650 Avenue 49, shortly after noon, according to sheriff’s investigators.\n\nCounty fire crews contained the flames to the lobby area about a half- hour later. There was smoke damage throughout the mosque, authorities said.\n\nNo one was injured.\n\nDial has no record of prior felony convictions in California."], ["Man accused of killing black man in 'practice run' charged with terrorism", "https://www.theguardian.com/us-news/2017/mar/27/new-york-stabbing-hate-crime-james-jackson-timothy-caughman", "James Jackson – who is accused of attacking Timothy Caughman from behind  with a sword in New York – said he intended to deter interracial...", "Mar 27, 2017", "James Jackson said he envisioned a white woman thinking: ‘Well, if that guy feels so strongly about it, maybe I shouldn’t do it.’ Photograph: Steven Hirsch/Associated Press\n\nJames Jackson said he envisioned a white woman thinking: ‘Well, if that guy feels so strongly about it, maybe I shouldn’t do it.’ Photograph: Steven Hirsch/Associated Press\n\nNew York\n\nMan accused of killing black man in 'practice run' charged with terrorism\n\nThis article is more than 6 years old\n\nJames Jackson – who is accused of attacking Timothy Caughman from behind with a sword in New York – said he intended to deter interracial relationships\n\nAssociated Press\n\nTue 28 Mar 2017 01.07 BST\n\n\n\n\n\n\n\nA white suspect accused of the fatal stabbing of a black man on a Manhattan street has been indicted on a charge of murder as an act of terrorism.\n\nJames Harris Jackson, 28, appeared briefly in court on Monday and did not speak. Prosecutors had previously also charged him with murder as a hate crime. Jackson’s attorney had no comment.\n\nWhite veteran 'regarded fatal stabbing of black man as practice for larger attack'Read more\n\nJackson is accused of killing Timothy Caughman, 66, a stranger to him. Caughman was attacked from behind last week as he was collecting bottles for recycling.\n\nAn arraignment on the indictment has been set for 13 April.\n\nSpeaking with a reporter for the Daily News at New York City’s Rikers Island jail complex, Jackson said he had intended it as “a practice run” in a mission to deter interracial relationships.\n\nHe said he envisioned a white woman thinking: “Well, if that guy feels so strongly about it, maybe I shouldn’t do it.”\n\nCaughman, who was remembered as a gentleman and a good neighbor, was alone when he was attacked from behind with a sword. He staggered, bleeding, into a police station and later died at a hospital.\n\n“Tim Caughman did not deserve to die like that,” said Portia Clark, a childhood friend who grew up in Queens and attended the hearing with Caughman’s other friends on Monday. “Nobody does. I mean, come on, we’re black, white, yellow, brown – that’s ridiculous. We’re trying to get along.”\n\nCarl Nimmons wept outside court after seeing Jackson. “It really hurt me to see that man, because I can’t do nothing about it. I don’t have the power to do anything about it,” he said.\n\nIn the Rikers interview, Jackson said in retrospect that he would rather have killed “a young thug” or “a successful older black man with blondes ... people you see in Midtown. These younger guys that put white girls on the wrong path”.\n\nHe complained that on television, “it’s like every other commercial in the past few years has a mixed-race couple in it”.\n\n“The white race is being eroded ... No one cares about you. The Chinese don’t care about you, the blacks don’t care about you,” he said.\n\nJackson, who was raised in what was described as a churchgoing, liberal family in a Baltimore suburb, said his ideal society was “1950s America”.\n\nJackson was in the army from 2009 to 2012 and worked as an intelligence analyst, the army said. Deployed in Afghanistan in 2010 until 2011, he earned several medals and attained the rank of specialist.\n\nThe military training, Jackson said, helped him plan the bloodshed.\n\n“I had been thinking about it for a long time, for the past couple of years,” he said. “I figured I would end up getting shot by police, kill myself, or end up in jail.”\n\nHis attorney, Sam Talkin, has said if the allegations are anywhere close to being true, “then we’re going to address the obvious psychological issues that are present in this case”.\n\nTopics\n\nNew York\n\nUS crime\n\nRace\n\nHate crime\n\nnews\n\n\n\n\n\n\n\n\n\n\n\n\n\nReuse this content\n\nMost viewed\n\nMost viewed"]]